<template>
  <UBlogList orientation="vertical">
    <UBlogPost
      v-for="({ title, description, image }, index) in blogs"
      :key="index"
      :title="title"
      :description="description"
      :image="{ src: image, alt: title }"
      orientation="horizontal"
    />
  </UBlogList>
</template>

<script setup>
const blogs = [
  {
    title: "Зачем нужна автоматизация доставки - как должна выглядеть идеальная доставка",
    description:
      "Вся механика доставки должна выстраиваться просто: клиент заходит на сайт, выбирает продукты из каталога, указывает адрес и временной слот доставки. Идеально, если доставка будет осуществляться в выбранный день (конечно, в зависимости от клиента, это всё может варьироваться). Курьер должен приезжать к клиенту в указанный временной слот.",
    image: "https://zig-zag.org/blog/2020/06/24/2020_06_24/logo.jpg",
  },
  {
    title: "Как мы оптимизировали маршруты медицинской компании для сборов тестов на COVID-19",
    description:
      "Привет, меня зовут Александр, я основатель компании Zig-Zag. В апреле мы разработали маршруты для компании «Приоритет», которой нужно было быстро собрать материалы для теста на COVID-19 у работников заправок «Газпрома. Делимся впечатлениями и опытом.",
    image: "https://zig-zag.org/blog/2020/04/29/2020_04_29/logo.jpg",
  },
  {
    title: "Мне говорили, что я идиот, но я продолжал скупать платёжные терминалы. Построение успешного бизнеса в падающей нише",
    description:
      "Разговор с Александром Власовым, основателем сервиса по оптимизации маршрутов Zig-Zag, владельцем крупнейшей сети терминалов Qiwi (платежных терминалов) в городе Ижевске.",
    image: "https://zig-zag.org/blog/2020/02/21/2020_02_21/logo.jpg",
  },
  {
    title: "Транспортировщики мусора утопают в бумажной отчетности. Что мешает вывозить мусор из контейнеров?",
    description: "Кейс компании Zig-Zag по внедрению цифровой автоматизации для транспортировщика мусора из Калининградской области. ",
    image: "https://zig-zag.org/blog/2020/02/18/2020_02_18_2/logo.jpg",
  },
];
</script>

<style></style>
